In [ ]:
import pandas as pd # 판다스를 pd 라고 부르겠다

In [7]:
data_list = [
    ["소라", 25, "언천"],
    ["창훈", 30, "순천"],
    ["영미", 35, "동해"]
]

columns = ["이름", "나이", "거주지"]

df = pd.DataFrame(data_list, columns=columns)

print(df)

   이름  나이 거주지
0  소라  25  언천
1  창훈  30  순천
2  영미  35  동해

In [11]:
# 02 파일을 데이터 프레임으로 가져오기

import pandas as pd

df = pd.read_excel("sales_data.xlsx")

print(df)
print(type(df))

           날짜  제품명  판매량    단가    총판매액
0  2023-01-01  제품A  100  1200  120000
1  2023-01-02  제품B  150  1500  225000
2  2023-01-03  제품C  200  1300  260000
3  2023-01-04  제품D  170  1600  272000
<class 'pandas.core.frame.DataFrame'>

In [ ]:
# 03 데이터프레임을 파일로 저장하기

import pandas as pd

data = [
    [1, "파이썬 프로그래밍", "김파이썬", 2019],
    [2, "데이터 분석", "이데이터", 2020],
    [3, "머신러닝 입문", "박머신", 2018],
    [4, "인공지능의 이해", "최인공", 2021]
]

columns = ["도서ID", "도서명", "저자", '출판년도']

books_df = pd.DataFrame(data, columns=columns) #data=data도 가능하다 다만 문법상 adta만 적어서 사용한다.

books_df.to_excel("도서_데이터.xlsx")

print(books_df)
print(type(books_df))

   도서ID        도서명    저자  출판년도
0     1  파이썬 프로그래밍  김파이썬  2019
1     2     데이터 분석  이데이터  2020
2     3    머신러닝 입문   박머신  2018
3     4   인공지능의 이해   최인공  2021
<class 'pandas.core.frame.DataFrame'>

In [16]:
# shape, columns 속성으로 데이터 정보 파악

import pandas as pd

data_list = [
    ["소라", 25, "언천"],
    ["창훈", 30, "순천"],
    ["영미", 35, "동해"]
]
columns = ["이름", "나이", "거주지"]
df = pd.DataFrame(data_list, columns=columns)

print(df.shape)

df

(3, 3)

   이름  나이 거주지
0  소라  25  언천
1  창훈  30  순천
2  영미  35  동해

In [19]:
print(df.shape)
print(df.columns)
print(len(df.columns))

(3, 3)
Index(['이름', '나이', '거주지'], dtype='object')
3

In [22]:
#head(),tail() 데이터 엿보기

import pandas as pd

import pandas as pd

data_list = [
    ["소라", 25, "언천"],
    ["창훈", 30, "순천"],
    ["영미", 35, "동해"],
    ["소라", 25, "언천"],
    ["창훈", 30, "순천"],
    ["영미", 35, "동해"],
    ["소라", 25, "언천"],
    ["창훈", 30, "순천"],
    ["영미", 35, "동해"]
]
columns = ["이름", "나이", "거주지"]
df = pd.DataFrame(data_list, columns=columns)
print(df.shape)
print(df.head())
print(df.tail())

(9, 3)
   이름  나이 거주지
0  소라  25  언천
1  창훈  30  순천
2  영미  35  동해
3  소라  25  언천
4  창훈  30  순천
   이름  나이 거주지
4  창훈  30  순천
5  영미  35  동해
6  소라  25  언천
7  창훈  30  순천
8  영미  35  동해

In [25]:
print(df.head(2))
print(df.tail(2))

   이름  나이 거주지
0  소라  25  언천
1  창훈  30  순천
   이름  나이 거주지
7  창훈  30  순천
8  영미  35  동해

In [30]:
# 열 이름 또는 인덱스로 데이터 선택하기

data_list = [
    ["소라", 25, "언천"],
    ["창훈", 30, "순천"],
    ["영미", 35, "동해"],
    ["소라", 25, "언천"],
    ["창훈", 30, "순천"],
    ["영미", 35, "동해"],
    ["소라", 25, "언천"],
    ["창훈", 30, "순천"],
    ["영미", 35, "동해"]
]
columns = ["이름", "나이", "도시"]
df = pd.DataFrame(data_list, columns=columns)

column_data = df["도시"]

print(type(column_data))
print(column_data)

<class 'pandas.core.series.Series'>
0    언천
1    순천
2    동해
3    언천
4    순천
5    동해
6    언천
7    순천
8    동해
Name: 도시, dtype: object

In [37]:
selected_columns = df[["도시", "이름"]]
print(type(selected_columns))
print(selected_columns)

column_data = df[["도시"]]
column_data

<class 'pandas.core.frame.DataFrame'>
   도시  이름
0  언천  소라
1  순천  창훈
2  동해  영미
3  언천  소라
4  순천  창훈
5  동해  영미
6  언천  소라
7  순천  창훈
8  동해  영미

   도시
0  언천
1  순천
2  동해
3  언천
4  순천
5  동해
6  언천
7  순천
8  동해

In [33]:
# 행선택하기

import pandas as pd

data_list = [
    ["소라", 25, "언천"],
    ["창훈", 30, "순천"],
    ["영미", 35, "동해"],
    ["소라", 25, "언천"],
    ["창훈", 30, "순천"],
    ["영미", 35, "동해"],
    ["소라", 25, "언천"],
    ["창훈", 30, "순천"],
    ["영미", 35, "동해"]
]
columns = ["이름", "나이", "도시"]
df = pd.DataFrame(data_list, columns=columns)

row = df.loc[0]
print(row)

이름    소라
나이    25
도시    언천
Name: 0, dtype: object

In [35]:
selected_rows1 = df.loc[[0, 2]]
print(selected_columns)
print(type(selected_columns))

   도시  이름
0  언천  소라
1  순천  창훈
2  동해  영미
3  언천  소라
4  순천  창훈
5  동해  영미
6  언천  소라
7  순천  창훈
8  동해  영미
<class 'pandas.core.frame.DataFrame'>

In [36]:
# 슬라이싱

selected_row2 = df.loc[1:2]
print(selected_row2)

   이름  나이  도시
1  창훈  30  순천
2  영미  35  동해

In [39]:
# df의 모든 행에 대한 "도시" 열 데이터 선택

selected_column = df.loc[:, "도시"]
print(selected_column)

0    언천
1    순천
2    동해
3    언천
4    순천
5    동해
6    언천
7    순천
8    동해
Name: 도시, dtype: object

In [40]:
selected_column1 = df.loc[:, ["도시", "이름"]]
print(selected_column1)

   도시  이름
0  언천  소라
1  순천  창훈
2  동해  영미
3  언천  소라
4  순천  창훈
5  동해  영미
6  언천  소라
7  순천  창훈
8  동해  영미

In [41]:
selected_column2 = df.loc[1:5, ["나이", "도시"]]
print(selected_column2)

   나이  도시
1  30  순천
2  35  동해
3  25  언천
4  30  순천
5  35  동해

In [42]:
selected_value = df.loc[0, "이름"]
print(selected_value)

소라

In [45]:
# iloc[] 인덱싱을 이용한 데이터 추출

row1 = df.iloc[0]

column = df.iloc[:, 1]

print(row1)
print("------------")
print("column")

이름    소라
나이    25
도시    언천
Name: 0, dtype: object
------------
column

In [46]:
df.iloc[:, 1]

0    25
1    30
2    35
3    25
4    30
5    35
6    25
7    30
8    35
Name: 나이, dtype: int64

In [47]:
last_column = df.iloc[:, -1]
print(last_column)

0    언천
1    순천
2    동해
3    언천
4    순천
5    동해
6    언천
7    순천
8    동해
Name: 도시, dtype: object

In [52]:
rows_iloc1 = df.iloc[0:2]
rows_iloc2 = df.loc[0:2]
print(rows_iloc1)
print(rows_iloc2)

   이름  나이  도시
0  소라  25  언천
1  창훈  30  순천
   이름  나이  도시
0  소라  25  언천
1  창훈  30  순천
2  영미  35  동해

In [53]:
df.iloc[:, 1:2]

   나이
0  25
1  30
2  35
3  25
4  30
5  35
6  25
7  30
8  35

In [54]:
rows_list = df.iloc[[0,2]]
print(rows_list)

   이름  나이  도시
0  소라  25  언천
2  영미  35  동해

In [55]:
column_list = df.iloc[:, [0, 2]]
print(column_list)

   이름  도시
0  소라  언천
1  창훈  순천
2  영미  동해
3  소라  언천
4  창훈  순천
5  영미  동해
6  소라  언천
7  창훈  순천
8  영미  동해

In [56]:
# 슬라이싱

selected_rows = df[0:2]
print(selected_rows)

   이름  나이  도시
0  소라  25  언천
1  창훈  30  순천

In [60]:
## 조건으로 특정데이터 필터링

filtered_rows1 = df[df["나이"] >= 30]
print(filtered_rows1)

   이름  나이  도시
1  창훈  30  순천
2  영미  35  동해
4  창훈  30  순천
5  영미  35  동해
7  창훈  30  순천
8  영미  35  동해

In [73]:
condition = (df["나이"] >= 30) & (df["도시"] != "서울")

filtered_rows3 = df[condition]

print(filtered_rows3)

   이름  나이  도시
1  창훈  30  순천
2  영미  35  동해
4  창훈  30  순천
5  영미  35  동해
7  창훈  30  순천
8  영미  35  동해

In [76]:
조건 = df["도시"].isin(["순천"])
df[조건]

   이름  나이  도시
1  창훈  30  순천
4  창훈  30  순천
7  창훈  30  순천